10/data/attachments/d118ff08e99c4d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Monica_reflect_Friend_54870_3</nif:username>
            <nif:friendToBeRequested>soap_friends_d439e020-d2e4-47bd-9aac-ecc0b42b9abd</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>